main_menu = {
    'start': 'Добро пожаловать в наш wallet-bot 👋',
    'menu': 'Это главное меню 🏠',
    'my_wallet': 'Здесь будет указан баланс пользователя 💵',
    'market': 'Здесь будет Р2Р маркет.',
    'support': 'Здесь будет тех. поддержка.',
    'settings': 'Здесь будут настройки.',
}

withdraw = {
    'currency': 'Какую монету хотите перевести?',
    'address': 'На какой адрес отправить?',
    'wrong_address': 'Введен некорректный адрес. Адрес должен состоять из 34 символов (латинские буквы и цифры). '
    'Введите адрес повторно.',
    'amount': 'Какую сумму переводим?',
    'wrong_amount': 'Введена некорректная сумма. Попробуйте еще раз. Пример: 0.001',
    'confirmation': 'Перевод {amount} {currency} на адрес {address}.\nВсе верно?',
    'success': '✅ Транзакция на перевод средств создана. Ожидайте зачисления.',
    'failed': '❌ Что-то пошло не так. Проверьте все данные и повторите попытку позднее.',
}

buttons = {
    'menu': '🏠 Открыть главное меню',
    'my_wallet': '💰 Мой кошелек',
    'market': '📈 P2P-маркет',
    'support': '❓ Поддержка',
    'settings': '⚙️ Настройки',
    'back': '🔙 Назад',
    'withdraw': '💸 Сделать перевод',
    'BTC': 'BTC',
    'yes_confirm': '✅ Да, все верно',
}

ui_commands = {
    'start': '🤖 Стартовое сообщение',
    'menu': '🏠 Главное меню',
    'my_wallet': '💰 Мой кошелек',
}
